# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Le génie logiciel pour un ingénieur en /Machine Learning/
#+AUTHOR: Kévin CAYE
#+LANGUAGE: fr

# reveal options: see https://github.com/yjwen/org-reveal
#+REVEAL_ROOT: file:/home/cayek/.src/reveal.js
#+REVEAL_TRANS: none
#+REVEAL_PLUGINS: (highlight notes)
#+OPTIONS: reveal_center:nil reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil toc:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+REVEAL_THEME: white
#+REVEAL_HLEVEL: 1 ## all header on same lvl
#+REVEAL_SPEED: fast
#+REVEAL_EXTRA_CSS: ./extra.css
#+REVEAL_EXTRA_JS: 



*** Programmation orienté objet: exemple en python
On veux ajouter les éléments d'un tableau 

#+BEGIN_SRC python :results output :exports both :eval no-export 
class Array:
    def __init__(self, data):
        self.data = data

    def add(self, t2):
        for i in range(len(self.data)):
            self.data[i] = t2.data[i] + self.data[i]

a1 = Array([1,2,3])
a2 = Array([3,8,6])
a1.add(a2)
print(a1.data)
#+END_SRC

#+RESULTS:
: [4, 10, 9]

#+BEGIN_NOTES
- On commence par creer un objet et on lui définie une méthodes.
#+END_NOTES

*** Programmation fonctionnel: un exemple en python 
On veux ajouter les éléments d'un tableau 

#+BEGIN_SRC python :results output :exports both :eval no-export 
def add(x, y):
    return x + y

a1 = [1,2,3]
a2 = [3,8,6]

print(map(add, a1, a2))
#+END_SRC

#+RESULTS:
: [4, 10, 9]

#+BEGIN_NOTES
- on utilise les types de base python et on cherche découper la tache en
  fonctions
#+END_NOTES

